brew "bat"
brew "btop"
brew "python@3.13"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "gcc"
brew "gh"
brew "gnu-tar"
brew "gum"
brew "lua"
brew "luarocks"
brew "midnight-commander"
brew "neovim"
brew "podman"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
