brew "bat"
brew "btop"
brew "python@3.13"
brew "crystal"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "gh"
brew "gnu-tar"
brew "gum"
brew "jp2a"
brew "lolcat"
brew "midnight-commander"
brew "neovim"
brew "node"
brew "pipx"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
vscode "vscodevim.vim"
