# Brewfile
# This file contains all the Homebrew packages installed on this system
# To install all packages listed here, run: brew bundle install

# Development Tools
brew 'crystal'
brew 'gh'           # GitHub CLI
brew 'neovim'
brew 'node'
brew 'python@3.13'
brew 'tree-sitter'
brew 'llvm'
brew 'z3'            # Theorem prover/solver

# Shell Utilities
brew 'bat'          # Better cat
brew 'eza'          # Modern ls replacement
brew 'fastfetch'    # System information tool
brew 'neofetch'     # System information tool
brew 'starship'     # Cross-shell prompt
brew 'tree'         # Directory listing as a tree
brew 'zoxide'       # Smarter cd command

# ZSH Enhancements
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Image Processing
brew 'jpeg-turbo'
brew 'libexif'
brew 'libpng'
brew 'libtiff'
brew 'webp'

# Compression Libraries
brew 'lz4'
brew 'xz'
brew 'zstd'

# String/Text Processing
brew 'icu4c@77'
brew 'libunistring'
brew 'oniguruma'
brew 'pcre2'
brew 'utf8proc'

# Development Dependencies
brew 'libgit2'
brew 'libnghttp2'
brew 'libssh2'
brew 'libuv'
brew 'libyaml'

# Lua-related
brew 'lpeg'
brew 'luajit'
brew 'luv'

# System Libraries and Dependencies
brew 'bdw-gc'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'gettext'
brew 'gmp'
brew 'libevent'
brew 'mpdecimal'
brew 'ncurses'
brew 'openssl@3'
brew 'pkgconf'
brew 'readline'
brew 'screenresolution'
brew 'sqlite'
brew 'unibilium'

